; domain
; source: https://github.com/AI-Planning/pddl-generators/blob/main/ferry/domain.pddl
; updates: typing car and locations; sail precs have now (not (at-ferry ?to)) so (not-eq ?from ?to) can be removed
(define (domain ferry)
   (:requirements :typing :strips :negative-preconditions)
   (:types car - object 
           location - object)

   (:predicates
		(at-ferry ?l - location)
		(at ?c - car ?l - location)
		(empty-ferry)
		(on ?c - car))

   (:action sail
       :parameters  (?from - location ?to - location)
       :precondition (and (at-ferry ?from) (not (at-ferry ?to)))
       :effect (and  (at-ferry ?to) (not (at-ferry ?from))))

   (:action board
       :parameters (?car - car ?loc - location)
       :precondition (and (at ?car ?loc) (at-ferry ?loc) (empty-ferry))
       :effect (and
            (on ?car)
		    (not (at ?car ?loc)) 
		    (not (empty-ferry))))

   (:action debark
       :parameters (?car - car  ?loc - location)
       :precondition (and (on ?car) (at-ferry ?loc))
       :effect (and
            (at ?car ?loc)
		    (empty-ferry)
		    (not (on ?car)))))

; problem
(define (problem ferry-87)
 (:domain ferry)
 (:objects 
    car1 car2 car3 car4 car5 car6 car7 car8 car9 car10 car11 car12 car13 car14 car15 car16 car17 car18 - car
    loc1 loc2 loc3 loc4 loc5 loc6 loc7 loc8 loc9 loc10 loc11 loc12 loc13 loc14 - location
 )
 (:init 
    (empty-ferry)
    (at-ferry loc4)
    (at car1 loc3)
    (at car2 loc3)
    (at car3 loc4)
    (at car4 loc7)
    (at car5 loc14)
    (at car6 loc3)
    (at car7 loc9)
    (at car8 loc7)
    (at car9 loc12)
    (at car10 loc2)
    (at car11 loc12)
    (at car12 loc9)
    (at car13 loc10)
    (at car14 loc6)
    (at car15 loc6)
    (at car16 loc8)
    (at car17 loc13)
    (at car18 loc11)
)
 (:goal (and 
(at car1 loc1)
(at car2 loc4)
(at car3 loc7)
(at car4 loc8)
))
)

; plan
1. (sail loc4 loc3)
   deleted: (at-ferry loc4)
   added: (at-ferry loc3)
   goals met: 0 of 4
2. (board car2 loc3)
   deleted: (at car2 loc3) (empty-ferry)
   added: (on car2)
   goals met: 0 of 4
3. (sail loc3 loc4)
   deleted: (at-ferry loc3)
   added: (at-ferry loc4)
   goals met: 0 of 4
4. (debark car2 loc4)
   deleted: (on car2)
   added: (at car2 loc4) (empty-ferry)
   goals met: 1 of 4
5. (board car3 loc4)
   deleted: (at car3 loc4) (empty-ferry)
   added: (on car3)
   goals met: 1 of 4
6. (sail loc4 loc7)
   deleted: (at-ferry loc4)
   added: (at-ferry loc7)
   goals met: 1 of 4
7. (debark car3 loc7)
   deleted: (on car3)
   added: (at car3 loc7) (empty-ferry)
   goals met: 2 of 4
8. (board car4 loc7)
   deleted: (at car4 loc7) (empty-ferry)
   added: (on car4)
   goals met: 2 of 4
9. (sail loc7 loc8)
   deleted: (at-ferry loc7)
   added: (at-ferry loc8)
   goals met: 2 of 4
10. (debark car4 loc8)
   deleted: (on car4)
   added: (at car4 loc8) (empty-ferry)
   goals met: 3 of 4
11. (sail loc8 loc3)
   deleted: (at-ferry loc8)
   added: (at-ferry loc3)
   goals met: 3 of 4
12. (board car1 loc3)
   deleted: (at car1 loc3) (empty-ferry)
   added: (on car1)
   goals met: 3 of 4
13. (sail loc3 loc1)
   deleted: (at-ferry loc3)
   added: (at-ferry loc1)
   goals met: 3 of 4
14. (debark car1 loc1)
   deleted: (on car1)
   added: (at car1 loc1) (empty-ferry)
   goals met: 4 of 4
